// Задача 23.
// Напишите программу, которая принимает на вход число (N) и выдаёт 
// таблицу кубов чисел от 1 до N.

// 3 -> 1, 8, 27
// 5 -> 1, 8, 27, 64, 125

Console.Clear();

int num, cube;

cube = 1;

Console.Write("Введите число: ");
num = Convert.ToInt32(Console.ReadLine());

while (cube < num + 1)
{
  cube * cube;
  Console.Write()
}